app/views/courses/show.html.erb

  <h2>Evaluaciones</h2>
  <% @course.evaluations.each do |evaluation| %>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = $1  [["course_id", 18]]

  <h2>Evaluaciones disponibles</h2>
  <% @course.evaluations.each do |evaluation| %>
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = $1  [["course_id", 18]]

      <ol>
        <% evaluation.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."evaluation_id" = $1  [["evaluation_id", 53]]