app/views/courses/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "enrollments" ON "users"."id" = "enrollments"."user_id" WHERE "enrollments"."course_id" = $1  [["course_id", 1]]
---
    <tbody>
      <% @course.enrollments.includes(:user).each do |enrollment| %>