app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    #@courses = Course.all
    @available_courses = Course.where.not(user: current_user)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."course_id" = $1  [["course_id", 1]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = $1  [["course_id", 1]]
---
  def show
    @course = Course.find(params[:id])
    @enrollment_request = EnrollmentRequest.find_by(user: current_user, course: @course)
    #@students = @course.enrollments.includes(:user) # Obtener estudiantes inscritos
    #@evaluations = @course.evaluations.includes(:questions) # Obtener evaluaciones del curso
    #@evaluation = Evaluation.new
    #@enrollment_request = EnrollmentRequest.new
    #@students_with_grades = @course.users.includes(:evaluations)  # Aquí se obtiene la lista de usuarios inscritos

    # Agregamos esto para obtener los alumnos inscritos y sus evaluaciones
    if current_user.tipo == "Profesor" && current_user == @course.user
      @enrolled_students = @course.enrolled_users.includes(:enrollment_requests)
      @student_evaluations = {}
      @enrolled_students.each do |student|
        @student_evaluations[student.id] = @course.evaluations.map do |evaluation|

INSERT INTO "courses" ("title", "description", "scheduled_date", "materials", "modality", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @course = current_user.courses.build(course_params)
    if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."user_id" = $1 AND "enrollment_requests"."course_id" = $2 LIMIT $3  [["user_id", 1], ["course_id", 22], ["LIMIT", 1]]
DELETE FROM "enrollment_requests" WHERE "enrollment_requests"."id" = $1  [["id", 34]]
---
  def leave
    @course = Course.find(params[:id])
    enrollment_request = current_user.enrollment_requests.find_by(course: @course)
    if enrollment_request&.destroy