app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "description", "scheduled_date", "materials", "modality", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @course = current_user.courses.build(course_params)
    if @course.save

DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 20]]
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" != $1  [["user_id", 1]]
---
  def available_courses
    @courses = Course.where.not(user: current_user)

SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."user_id" = $1 AND "enrollment_requests"."course_id" = $2 LIMIT $3  [["user_id", 1], ["course_id", 22], ["LIMIT", 1]]
DELETE FROM "enrollment_requests" WHERE "enrollment_requests"."id" = $1  [["id", 34]]
---
  def leave
    @course = Course.find(params[:id])
    enrollment_request = current_user.enrollment_requests.find_by(course: @course)
    if enrollment_request&.destroy