app/controllers/enrollment_requests_controller.rb

  def index
    @course = Course.find(params[:course_id])
    @enrollment_requests = @course.enrollment_requests.where(status: 'pending')
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."course_id" = $1 AND "enrollment_requests"."status" = $2  [["course_id", 16], ["status", "pending"]]

  def accept
    @course = @enrollment_request.course
    if @course.users.include?(@enrollment_request.user)
      redirect_to @course, alert: 'El usuario ya está inscrito en el curso.'
    else
      @course.users << @enrollment_request.user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "enrollment_requests" ("user_id", "status", "created_at", "updated_at", "course_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["status", "pending"], ["created_at", "2024-10-04 02:36:02.210392"], ["updated_at", "2024-10-04 02:36:02.210392"], ["course_id", 16]]

  def create
    @course = Course.find(params[:course_id])
    @enrollment_request = current_user.enrollment_requests.new(course: @course)
    if @enrollment_request.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "enrollment_requests" ("user_id", "course_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["course_id", 1], ["status", "pending"], ["created_at", "2024-10-04 06:40:04.836762"], ["updated_at", "2024-10-04 06:40:04.836762"]]

  def approve
    @enrollment_request = EnrollmentRequest.find(params[:id])
    @enrollment_request.update(status: 'approved')
---
SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "enrollment_requests" SET "status" = $1, "updated_at" = $2 WHERE "enrollment_requests"."id" = $3  [["status", "approved"], ["updated_at", "2024-10-04 02:35:22.389015"], ["id", 19]]