app/controllers/enrollment_requests_controller.rb

SELECT "enrollment_requests".* FROM "enrollment_requests" WHERE "enrollment_requests"."course_id" = $1 AND "enrollment_requests"."id" = $2 LIMIT $3  [["course_id", 18], ["id", 45], ["LIMIT", 1]]
UPDATE "enrollment_requests" SET "status" = $1, "updated_at" = $2 WHERE "enrollment_requests"."id" = $3  [["status", "approved"], ["updated_at", "2024-10-04 16:43:21.223977"], ["id", 45]]
---
  def approve
    @enrollment_request = @course.enrollment_requests.find(params[:id])
    @enrollment_request.update(status: 'approved')

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def set_course
    @course = Course.find(params[:course_id])