app/controllers/evaluations_controller.rb

  def new
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @course = Course.find(params[:course_id])
    @evaluation = @course.evaluations.build(evaluation_params)

    if @evaluation.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "evaluations" ("name", "questions", "solution", "evaluation_method", "class_id", "created_at", "updated_at", "course_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"